tests/integration/test_standard_BC_lookup/foam_template/0.org/T_BC
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "foam_template/0.org";
    object      T_BC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField 
{ 
    OUTLET
    {
        type    zeroGradient;
    }
    INLET
    {
        type    zeroGradient;
    }
    WALL
    {
        type    fixedValue;
        value   nonuniform List<scalar>
        400        (
        959.7873178678517 
        828.7339849360878 
        1139.9906881992024 
        1526.2606608555232 
        641.5300076220251 
        1392.0121648488523 
        1314.1730794143689 
        705.8672002869806 
        779.9946789709733 
...
        );
    }
} 


// ************************************************************************* //