tests/integration/test_standard_BC_lookup/foam_template/0.org/Z
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "foam_template/0.org";
    object      Z;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar>
100(
0.6 
0.9 
0.0 
0.6 
0.9 
0.5 
0.5 
0.4 
0.0 
...
);

boundaryField 
{ 
    OUTLET
    {
        type    zeroGradient;
    }
    INLET
    {
        type    zeroGradient;
    }
    WALL
    {
        type    zeroGradient;
    }
} 


// ************************************************************************* //