tests/integration/test_standard_BC_lookup/foam_template/0.org/ha
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "foam_template/0.org";
    object      ha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar>
100(
-2106085.7004859257 
-1036944.1849580226 
809004.1739091916 
-2451945.045319855 
-1036944.1849662897 
-1399279.900996843 
-778008.5705374139 
-1864569.4031510572 
943521.44109111 
...
);

boundaryField 
{ 
    OUTLET
    {
        type    zeroGradient;
    }
    INLET
    {
        type    zeroGradient;
    }
    WALL
    {
        type    boundaryLookup;
	lookupType standardBoundaryLookup; //standardBoundaryLookup is default
        value   uniform 0;
    }
} 


// ************************************************************************* //
