tests/integration/test_standard_BC_lookup/foam_template/0.org/yc
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "foam_template/0.org";
    object      yc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar>
100(
0.1653711554499465 
0.01866652002780874 
0.0 
0.12065149740991586 
0.04666630006952185 
0.22369245682899105 
0.2332261502054858 
0.023030565930430198 
0.0 
...
);

boundaryField 
{ 
    OUTLET
    {
        type    zeroGradient;
    }
    INLET
    {
        type    zeroGradient;
    }
    WALL
    {
        type    zeroGradient;
    }
} 


// ************************************************************************* //